[
  {
    "title": "TSMC - Wikipedia",
    "url": "https://en.wikipedia.org/wiki/TSMC",
    "domain": "en.wikipedia.org",
    "lang": "en",
    "summary": "TSMC\nTaiwan Semiconductor Manufacturing Company Limited (TSMC or Taiwan Semiconductor)[4][5] is a Taiwanese multinational semiconductor contract manufacturing and design company."
  },
  {
    "title": "TSMC extends record quarter, profit jumps 35% on robust AI chip demand - CNBC",
    "url": "https://www.cnbc.com/2026/01/15/tsmc-q4-profit-record-ai-chip-demand-nt1-trillion.html",
    "domain": "www.cnbc.com",
    "lang": "en",
    "summary": "Taiwan Semiconductor Manufacturing Company on Thursday reported a 35% increase in fourth-quarter profit, beating estimates and hitting a fresh record as demand for artificial intelligence chips remained strong.\nHere are the company's results versus LSEG SmartEstimates, which are weighted toward forecasts from analysts who are more consistently accurate:\n- Revenue: 1.046 trillion new Taiwan dollars ($33.73 billion), vs. NT$1.034 trillion expected\n- Net income: NT$505.74 billion, vs."
  },
  {
    "title": "TSMC Q4 FY 2025 Results and 2026 Outlook Signal AI-Led Growth - Futurum",
    "url": "https://futurumgroup.com/insights/tsmc-q4-fy-2025-results-and-fy-2026-outlook-signal-ai-led-growth/",
    "domain": "futurumgroup.com",
    "lang": "en",
    "summary": "Analyst(s): Futurum Research\nPublication Date: January 16, 2026\nTSMC’s Q4 FY 2025 update highlights broad-based strength in 3-nanometer and 5-nanometer demand across AI accelerators and high-end smartphones, alongside a tight capacity backdrop."
  },
  {
    "title": "TSMC surges after posting stellar Q4 results, impressive Q1 outlook",
    "url": "https://sherwood.news/markets/tsmc-q4-2025-earnings-chips-semiconductors-ai-boom-foundry/",
    "domain": "sherwood.news",
    "lang": "en",
    "summary": "TSMC surges after posting stellar Q4 results, impressive Q1 outlook\nThe foundry giant plans to spend way more on capex this year to meet growing demand from the AI boom.\nTSMC is ripping higher in premarket trading after the world’s largest chip manufacturer posted superb Q4 results and offered a Q1 outlook that was brighter than analysts had anticipated.\nThe Taiwanese firm posted Q4 earnings per share of NT$19.50 (or $0.63), well above estimates for NT$18.12 (or $0.57)."
  },
  {
    "title": "TSMC Earnings Call Predictions: Q4 2025 Results and 2026 Outlook | Erudite Asia posted on the topic | LinkedIn",
    "url": "https://www.linkedin.com/posts/erudite-asia_台積電法說會倒數-五大預測一次看-聯合新聞網-activity-7417878320245301248-2yLl",
    "domain": "www.linkedin.com",
    "lang": "en",
    "summary": "Counting Down to TSMC's Earnings Call: Five Key Predictions at a Glance TSMC will hold its investor conference on January 15, 2026, serving as a key market indicator. Five major predictions include the fourth-quarter 2025 financials, first-quarter outlook, full-year 2026 forecast, capital expenditure plans, and gross margin trends. The fourth-quarter results and guidance for 2025 are expected to surpass earlier estimates. Revenue in U.S."
  }
]