[
  {
    "title": "Humanoid Robot Market Expected to Reach $5 Trillion by 2050 | Morgan ...",
    "url": "https://www.morganstanley.com/insights/articles/humanoid-robot-market-5-trillion-by-2050",
    "domain": "www.morganstanley.com",
    "lang": "en",
    "type": "Trusted",
    "trusted": true,
    "summary": "Easier Commercial and Industrial Use\nBy 2050, about 90% of humanoids, or about 930 million units, will likely be used for repetitive, simple, and structured work—primarily industrial and commercial purposes. China is likely to have the highest number of humanoid robots in use by 2050, at 302.3 million, trailed by the U.S."
  },
  {
    "title": "The global market for humanoid robots could reach $38 billion ...",
    "url": "https://www.goldmansachs.com/insights/articles/the-global-market-for-robots-could-reach-38-billion-by-2035",
    "domain": "www.goldmansachs.com",
    "lang": "en",
    "type": "Trusted",
    "trusted": true,
    "summary": "Artificial IntelligenceThe global market for humanoid robots could reach $38 billion by 2035\nWill robots become the next smartphones?\nThe worldwide market for humanoid robots is forecast to be bigger than analysts in Goldman Sachs Research expected even a year ago."
  },
  {
    "title": "Humanoid robot: The AI accelerant - Goldman Sachs",
    "url": "https://www.goldmansachs.com/insights/goldman-sachs-research/global-automation-humanoid-robot-the-ai-accelerant",
    "domain": "www.goldmansachs.com",
    "lang": "en",
    "type": "Trusted",
    "trusted": true,
    "summary": "Goldman Sachs ResearchHumanoid robot: The AI accelerant\nIn this report, Goldman Sachs Research estimates that the global market for humanoid robots may reach a market size of at least US$6bn in 10-15 years, filling 4% of the US manufacturing labor shortage gap by 2030E and 2% of global elderly care demand by 2035E."
  },
  {
    "title": "Humanoid Robot Market: $357 Billion Impact Anticipated by ...",
    "url": "https://www.morganstanley.com/ideas/humanoid-robot-market-outlook-2024",
    "domain": "www.morganstanley.com",
    "lang": "en",
    "type": "Trusted",
    "trusted": true,
    "summary": "The U.S. is struggling with labor shortages caused by long-term demographic shifts that could take a toll on economic growth for years to come. Meanwhile, advances in large language models and generative artificial intelligence are expected to result in transformative innovations in industries from healthcare to manufacturing and beyond."
  }
]